"""
Задайте список из n чисел последовательности (1+1/n)^n и выведите на экран их сумму.
Пример:
- Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}
"""

n = int(input('Введите натуральное число: '))
print('{', end='')
for i in range(1, n):
    print(f'{i}: {round((1 + 1 / i)**i, 2)}, ', end='')
print(f'{n}: {round((1 + 1 / n)**n, 2)}', end='}')